12/data/attachments/70fba093ea91c5df.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Mark_middle_Friend_12257_4</nif:username>
            <nif:friendToBeRequested>soap_friends_d1312f10-2f27-468c-a685-2afde87b5468</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>